---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceLoadStatus
source: html/2f8c9146-6ae2-49a7-0a8b-cd544077602e.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadStatus

A flag to indicate the status of an ExternalResource load request.

## Syntax (C#)
```csharp
public enum ExternalResourceLoadStatus
```

## Remarks
This flag is returned by the LoadResource method of the IExternalResourceServer
 class to inform callers whether the load operation succeeded, or encountered
 an error.